/* 58. Длина последнего слова.
 *
 * Дана строка, состоящая из нескольких слов или предложений. Необходимо найти наибольшую подстроку в конце между пробелами.
 *
 * Ограничения:
 *     - строка обязательно содержит хотябы одно слово
 *     - длина строки не более 10000 символов
 *     - строка содержит только английские буквы и пробелы
 *
 */

package LeetCode;

public class LengthOfLastWord {

    public static void main(String[] args) {
        //This is main
    }

    public int lengthOfLastWord(String s) {

        return 0;
    }
}
